main/app/Helpers/Helper.php

select * from `sp_configurations` limit 1
---
    public static function config()
    {
        return Configuration::first();

select * from `sp_pages` where `status` = 1 and `name` != 'home'
---
    public static function pages()
    {
        return Page::where('status', 1)->where('name', '!=', 'home')->get();

select count(*) as aggregate from `sp_users` where `status` = 0
select count(*) as aggregate from `sp_users` where `is_email_verified` = 0
select count(*) as aggregate from `sp_users` where `is_sms_verified` = 0
select count(*) as aggregate from `sp_users` where `is_kyc_verified` in (0, 2)
select count(*) as aggregate from `sp_users` where `is_kyc_verified` = 2 and `kyc_information` is not null
select count(*) as aggregate from `sp_tickets` where `status` = 2
select count(*) as aggregate from `sp_withdraws` where `status` = 0
---
    public static function sidebarData()
    {
        $data['deactiveUser'] = User::where('status', 0)->count();
        $data['emailUnverified'] = User::where('is_email_verified', 0)->count();
        $data['smsUnverified'] = User::where('is_sms_verified', 0)->count();
        $data['kycUnverified'] = User::whereIn('is_kyc_verified', [0, 2])->count();
        $data['kyc_req'] = User::where('is_kyc_verified', 2)->where('kyc_information', '!=', null)->count();

        $data['pendingTicket'] = Ticket::where('status', 2)->count();

        $data['pendingWithdraw'] = Withdraw::where('status', 0)->count();

select * from `sp_configurations` limit 1
---
    public static function theme()
    {
        return 'frontend.' . Configuration::first()->theme . '.';

select * from `sp_contents` where `type` = 'iteratable' and `theme` = 'default' and `name` = 'socials'
select * from `sp_contents` where `type` = 'non_iteratable' and `theme` = 'default' and `name` = 'banner' limit 1
---
    public static function builder($section, $collection = false)
    {

        if ($collection) {
            return Content::where('type', 'iteratable')->where('theme', self::config()->theme)->where('name', $section)->get();
        }

        return Content::where('type', 'non_iteratable')->where('theme', self::config()->theme)->where('name', $section)->first();

insert into `sp_pivort_users` (`user_id`, `ref_id`, `level`, `updated_at`, `created_at`) values (43, 42, 1, '2026-02-05 10:58:24', '2026-02-05 10:58:24')
select * from `sp_referrals` where `status` = 1 and `type` = 'interest' limit 1
select * from `sp_pivort_users` where `user_id` = 42
---
    public static function referLevel($from, $to)
    {
        $user_id = $from;
        $newPivortUser = PivortUser::create([
            'user_id' => $user_id,
            'ref_id' => $to->id,
            'level' => 1,
        ]);
        $levelCount = Referral::where('status', 1)->where('type', 'interest')->first();
        if ($newPivortUser) {
            $oldPivortUser = PivortUser::where('user_id', $newPivortUser->ref_id)->get();

select * from `sp_pages` where `name` != 'home' and `is_dropdown` = 1 and `status` = 1 order by `order` asc
select * from `sp_pages` where `name` != 'home' and `is_dropdown` = 0 and `status` = 1 order by `order` asc
---
    public static function navbarMenus()
    {
        $dropdowns = Page::where('name', '!=', 'home')->where('is_dropdown', true)->where('status', 1)->orderBy('order', 'ASC')->get();

        $nonDropdowns = Page::where('name', '!=', 'home')->where('is_dropdown', false)->where('status', 1)->orderBy('order', 'ASC')->get();