main/app/Http/Requests/RegisterRequest.php

    public function rules()
    {
        $general = Configuration::first();
---
select * from `sp_configurations` limit 1