main/app/Http/Controllers/DepositController.php

    public function depositStoreTrd(Request $request)
    {
        $request->validate([
    'btrx_id' => 'required|string|unique:deposits,btrx_id',
], [
    'btrx_id.unique' => 'This Transaction ID already exists.',
]);

        // dd($request->all());
        if ($request->has('payment_proof')) {
            $filename = Helper::saveImage($request->payment_proof, Helper::filePath('admin'));
            $payment_proof = $filename;

        }

        $user = auth()->user();
        $deposit = Deposit::create([
            'trx' => Str::upper(Str::random(16)),
            'amount' => $request->amount,
            'total' => $request->amount,
            //  'address' => $request->address,
            'random_address' => $request->address,
            'btrx_id' => $request->btrx_id,
            'network' => $request->network,
            'charge' => 0,
            'gateway_id' => 16,
            'status' => 2,
            'type' => '+',
            'user_id' => auth()->id(),
            'payment_proof' => $payment_proof ,

        ]);
---
insert into `sp_deposits` (`trx`, `amount`, `total`, `random_address`, `btrx_id`, `network`, `charge`, `gateway_id`, `status`, `type`, `user_id`, `payment_proof`, `updated_at`, `created_at`) values ('JHUKDX55Q6OD46DC', '70', '70', 'TM5q9uK67QAvn6iW8YdG52WnBL3g38HVX8', '54225254455', 'TRC20', 0, 16, 2, '+', 42, '\"6984955604f101770296662.jpeg\"', '2026-02-05 13:04:22', '2026-02-05 13:04:22')