main/app/Http/Controllers/FrontendController.php

select * from `sp_pages` where `name` = 'home' limit 1
---
    public function index()
    {
        $data['page'] = Page::where('name', 'home')->first();

select * from `sp_pages` where `slug` = 'about' limit 1
---
    public function page(Request $request)
    {
        $data['page'] = Page::where('slug', $request->pages)->first();

select * from `sp_configurations` limit 1
select * from `sp_contents` where `theme` = 'default' and `name` = 'team' and `type` = 'iteratable' order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `sp_contents` where `theme` = 'default' and `name` = 'team' and `type` = 'iteratable'
---
    public function teams()
    {
        $theme = Configuration::first()->theme;

        $data['title'] = "Our Team";
        $data['team'] = Content::where('theme', $theme)->where('name', 'team')->where('type', 'iteratable')->latest()->paginate(Helper::pagination());