main/app/Http/Controllers/UserController.php

    public function team()
    {

        $user = auth()->user();
        $data['myTeam'] = PivortUser::where('ref_id', $user->id)->count();
        $data['directTeam'] = PivortUser::where('ref_id', '=', $user->id)->where('level', 1)->count();
        $data['indirectTeam'] = PivortUser::where('ref_id', '=', $user->id)->where('level', '!=', 1)->count();
---
select count(*) as aggregate from `sp_pivort_users` where `ref_id` = 39
select count(*) as aggregate from `sp_pivort_users` where `ref_id` = 39 and `level` = 1
select count(*) as aggregate from `sp_pivort_users` where `ref_id` = 39 and `level` != 1

    public function level()
    {
        $user = auth()->user();
        $data = [];
        $data['myTeamm'] = PivortUser::where('ref_id',$user->id)->pluck('user_id');
        $data['myTeamTwo'] = PivortUser::where(function ($query) use ($data, $user) {
            $query->where('ref_id', $user->id)
                ->orWhereIn('ref_id', $data['myTeamm']);
        });

        $levelCount = Referral::where('status', 1)->where('type', 'interest')->first();

        for ($level = 1; $level <= 10; $level++) {
            $levelUserIds = PivortUser::where('ref_id', '=', $user->id)->where('level', $level)->pluck('user_id');
//            $data["level{$level}"] = Transaction::where('user_id', '=', $user->id)
//                ->whereIn('rec_id', $levelUserIds)
//                ->where('type_two', [3, 5])
//                ->sum('amount');
            $data["level{$level}"] = Deposit::WhereIn('user_id',$levelUserIds)->sum('amount');
---
select sum(`amount`) as aggregate from `sp_deposits` where `user_id` = 42

    public function statistics()
    {
        $user = auth()->user();

        $data['staking'] = Deposit::where('user_id', '=', $user->id)->where('status', 1)->sum('amount');
        $data['receivable_reward'] = Transaction::whereIn('type_two',[5,3])->where('user_id', '=', $user->id)->sum('amount');

        $direct_user = PivortUser::where('ref_id', '=', $user->id)->where('level', 1)->pluck('user_id');
        $data['directReward'] = Transaction::where('user_id', '=', $user->id)->WhereIn('rec_id', $direct_user)->where('type_two', 3)->sum('amount');
        $data['indirectReward'] = Transaction::where('user_id', '=', $user->id)->whereNotIn('rec_id', $direct_user)->where('type_two', 3)->sum('amount');

        $data['maximum_reward'] = $user->tx ?? '0';
        $data['available_reward']  =  $user->ttx  ?? '0';
        $data['receive_reward'] = $data['maximum_reward'] + $data['available_reward'];


        return view(Helper::theme() . 'user.stat.index')->with($data);
---
select sum(`amount`) as aggregate from `sp_deposits` where `user_id` = 42 and `status` = 1
select sum(`amount`) as aggregate from `sp_transactions` where `type_two` in (5, 3) and `user_id` = 42
select `user_id` from `sp_pivort_users` where `ref_id` = 42 and `level` = 1
select sum(`amount`) as aggregate from `sp_transactions` where `user_id` = 42 and `rec_id` in (43) and `type_two` = 3
select sum(`amount`) as aggregate from `sp_transactions` where `user_id` = 42 and `rec_id` not in (43) and `type_two` = 3
select * from `sp_users` where `id` in (43) order by `created_at` desc limit 12 offset 0
select count(*) as aggregate from `sp_users` where `id` in (43)
select `user_id` from `sp_pivort_users` where `ref_id` = 42 and `level` = '1'

    public function transection()
    {
        $user = auth()->user();

        $data["totalAmountByDate"] = Transaction::where('user_id', '=', $user->id)->where('rec_id','!=',0)->whereIn('type_two',  [5])->selectRaw('DATE(created_at) as transaction_date, SUM(amount) as total_amount')
            ->groupBy('transaction_date')
            ->orderBy('transaction_date', 'desc')
            ->get();
        return view(Helper::theme() . 'user.stat.transection')->with($data);
---
select DATE(created_at) as transaction_date, SUM(amount) as total_amount from `sp_transactions` where `user_id` = 39 and `rec_id` != 0 and `type_two` in (5) group by `transaction_date` order by `transaction_date` desc
select * from `sp_users` where `id` in (44) order by `created_at` desc limit 12 offset 0
select count(*) as aggregate from `sp_users` where `id` in (44)

    public function levelTransection($date)
    {
        $user = auth()->user();
        $data = [];
        for ($level = 1; $level <= 10; $level++) {
            $levelUserIds = PivortUser::where('ref_id', '=', $user->id)->where('level', $level)->pluck('user_id');
            $data["level{$level}"] = Transaction::where('user_id', '=', $user->id)
                ->where('rec_id','!=',0)
                ->whereIn('rec_id', $levelUserIds)
                ->whereDate('created_at', $date)
                ->whereIn('type_two', [5])
                ->sum('amount');
        }
        return view(Helper::theme() . 'user.stat.level')->with($data);
---
select `user_id` from `sp_pivort_users` where `ref_id` = 43 and `level` = '1'
select sum(`amount`) as aggregate from `sp_transactions` where `user_id` = 44 and 0 = 1 and `type_two` = 3
select `user_id` from `sp_pivort_users` where `ref_id` = 44 and `level` = 1