main/app/Http/Controllers/UserController.php

select sum(`amount`) as aggregate from `sp_deposits` where `user_id` = 42
---
public function singlelevelUser($level)
{
    $user = auth()->user();

    // 🔹 Total deposit of logged-in user
    $totalDeposit = \App\Models\Deposit::where('user_id', $user->id)->sum('amount');