main/app/Http/Controllers/Backend/AdminProfileController.php

select * from `sp_transactions` where `type` = '+' and `type_two` = 5 and date(`created_at`) = '2026-03-26'
select * from `sp_users` where `sp_users`.`id` = 42 limit 1
update `sp_users` set `ttx` = 33.58, `sp_users`.`updated_at` = '2026-03-26 12:37:15' where `id` = 42
---
    public function percentageDelete(Request $request)
    {
        $tra = Transaction::where('type','+')->where('type_two',5)->whereDate('created_at',$request->date)->get();

        if($tra) {
            foreach ($tra as $row) {
                $user = User::find($row->user_id);
                $user->ttx = $user->ttx - $row->amount;
                $user->update();