main/app/Http/Controllers/Backend/AdminProfileController.php

    public function percentage()
    {
        $data['title'] = 'Percentage Commission';
        $data['data'] = Transaction::with('user')->where('type_two', '=',5)->where('type','+')->latest()->paginate(10);
---
select * from `sp_transactions` where `type_two` = 5 and `type` = '+' order by `created_at` desc limit 10 offset 0
select * from `sp_users` where `sp_users`.`id` in (30, 31, 32)
select count(*) as aggregate from `sp_transactions` where `type_two` = 5 and `type` = '+'

    public function metamaskPtop(Request $request)
    {
        $data['title'] = 'Metamask P2P Details';
        if(is_numeric($request->search)){
            $user = User::where('username',$request->search)->first();
            if($user) {
                $metmaskUser = Metamask::all()->pluck('trx_id');
                $data['data'] = Transaction::with('user')->whereIn('id',$metmaskUser)->where('user_id',$user->id)->latest()->paginate(Helper::pagination());
            }
            else{
                $metmaskUser = Metamask::all()->pluck('trx_id');
                $data['data'] = Transaction::with('user')->whereIn('id',$metmaskUser)->latest()->paginate(Helper::pagination());
            }
        }
        else{
            $metmaskUser = Metamask::all()->pluck('trx_id');
            $data['data'] = Transaction::with('user')->whereIn('id',$metmaskUser)->latest()->paginate(Helper::pagination());
---
select * from `sp_transactions` where `id` in ('131', '132', '139', '140') order by `created_at` desc limit 10 offset 0
select * from `sp_users` where `sp_users`.`id` in (30, 31)
select count(*) as aggregate from `sp_transactions` where `id` in ('131', '132', '139', '140')

    public function percentageStore(Request $request)
    {
        $dateString = $request->date;
        $carbonDate = Carbon::parse($dateString);
        $formattedDate = $carbonDate->format('Y-m-d H:i:s');
        $users = User::where('status', '=', 1)->where('balance', '>', 1)->get();
        if ($users->isNotEmpty()) {
            foreach ($users as $user) {

                $deposit = Deposit::where('user_id', '=', $user->id)->where('status', '=', 1)->sum('amount');
                if($deposit!=0){
                    $calculateamount = $user->balance * ($request->percentage / 100);
                    $userDeposit = $user->tx;
                    $check = $user->ttx + $calculateamount;
                    if ($userDeposit >= $check) {
//                        $profit = Transaction::where('user_id', '=', $user->id)->whereIn('type_two', [5, 3])->sum('amount');
                        $user->ttx = $user->ttx + $calculateamount;
                        $user->update();
                        Transaction::create([
                            'trx' => Str::upper(Str::random(16)),
                            'amount' => $calculateamount,
                            'details' => 'Your Daily Profit ' . ($request->percentage) . '% Added Successfully',
                            'charge' => 0,
                            'type' => '+',
                            'type_two' => 5,
                            'rec_id' => 0,
                            'user_id' => $user->id,
                            'created_at'=>$formattedDate
                        ]);
---
select * from `sp_users` where `status` = 1 and `balance` > 1
select sum(`amount`) as aggregate from `sp_deposits` where `user_id` = 30 and `status` = 1
update `sp_users` set `ttx` = 65.3335, `sp_users`.`updated_at` = '2024-04-09 13:10:31' where `id` = 30
insert into `sp_transactions` (`trx`, `amount`, `details`, `charge`, `type`, `type_two`, `rec_id`, `user_id`, `created_at`, `updated_at`) values ('MLHL2S16FSP2DBGH', 0.25, 'Your Daily Profit 1% Added Successfully', 0, '+', 5, 0, 30, '2024-04-01 00:00:00', '2024-04-09 13:10:31')


                    }
                    //Start Level Commission
                    $levelProfits = PivortUser::where('user_id', $user->id)->get();
                    $levelPercantages = Referral::where('type', 'invest')->where('status', 1)->pluck('commission');
                    if ($levelPercantages->isNotEmpty()) {
                        foreach ($levelProfits as $item) {
                            $userReffer = User::where('status',1)->where('id',$item->ref_id)->first();
                            $deposit = Deposit::where('user_id', $item->ref_id)->sum('amount');
                            if($deposit!=0) {
                                //Start Level Deposit Check
                                $userids = User::where('ref_id', $item->ref_id)->pluck('id');
                                $hasDeposit = \App\Models\Deposit::whereIn('user_id', $userids)->pluck('user_id')->unique();
                                $levelPercantages_two = Referral::where('type', 'interest')->where('status', 1)->pluck('commission');
---
select * from `sp_pivort_users` where `user_id` = 30
select `commission` from `sp_referrals` where `type` = 'invest' and `status` = 1
select * from `sp_users` where `status` = 1 and `id` = 30 limit 1
select sum(`amount`) as aggregate from `sp_deposits` where `user_id` = 30
select `id` from `sp_users` where `ref_id` = 30
select `user_id` from `sp_deposits` where `user_id` in (31, 32, 34)
select `commission` from `sp_referrals` where `type` = 'interest' and `status` = 1

                                    $checkk = $profit + $amount;
                                    if ($userDepositt >= $checkk) {

                                        $userProfit = User::where('id', $item->ref_id)->where('status', 1)->first();
---
select * from `sp_users` where `id` = 30 and `status` = 1 limit 1

                                            // Update user balance
                                            if ($profitAmount > 0.00) {
                                                $userProfit->ttx = $userProfit->ttx + $profitAmount;
                                                $userProfit->update();

                                                // Create transaction
                                                Transaction::create([
                                                    'trx' => Str::upper(Str::random(16)),
                                                    'amount' => $profitAmount,
                                                    'details' => 'Profit added refer by ' . $user->username,
                                                    'charge' => 0,
                                                    'type' => '+',
                                                    'type_two' => 5,
                                                    'rec_id' => $user->id,
                                                    'user_id' => $userProfit->id,
                                                    'created_at'=>$formattedDate
                                                ]);
---
update `sp_users` set `ttx` = 66.3085, `sp_users`.`updated_at` = '2024-04-09 13:10:31' where `id` = 30
insert into `sp_transactions` (`trx`, `amount`, `details`, `charge`, `type`, `type_two`, `rec_id`, `user_id`, `created_at`, `updated_at`) values ('IRGETBAGEIKBB7NG', 0.975, 'Profit added refer by 871040', 0, '+', 5, 31, 30, '2024-04-01 00:00:00', '2024-04-09 13:10:31')

    public function percentageDelete(Request $request)
    {
        $tra = Transaction::where('type','+')->where('type_two',5)->whereDate('created_at',$request->date)->get();

        if($tra) {
            foreach ($tra as $row) {
                $user = User::find($row->user_id);
                $user->ttx = $user->ttx - $row->amount;
                $user->update();
---
select * from `sp_transactions` where `type` = '+' and `type_two` = 5 and date(`created_at`) = '2024-04-01'
select * from `sp_users` where `sp_users`.`id` = 31 limit 1
update `sp_users` set `ttx` = 66.7495, `sp_users`.`updated_at` = '2024-04-09 13:12:27' where `id` = 30