main/app/Http/Controllers/Backend/ConfigurationController.php

    public function index()
    {
        $data['title'] = 'Application Settings';

        $data['general'] = Configuration::first();
---
select * from `sp_configurations` limit 1

    public function themeColor(Request $request)
    {
        $general = Configuration::first();

        $color = is_array($general->color) ? $general->color :  [];


        $color[$request->theme] = $request->color;


        $general->color = $color;

        $general->save();
---
select * from `sp_configurations` limit 1
update `sp_configurations` set `color` = '{\"default\":\"#FFC300\"}', `sp_configurations`.`updated_at` = '2026-01-14 10:12:08' where `id` = 1