main/app/Http/Controllers/Backend/DashboardController.php

    public function dashboard(Request $request)
    {


        $data['title'] = __('Admin Dashboard');

        $data['totalDeposit'] = Deposit::where('status', 1)->sum('amount');
        $data['pendingDeposit'] = Deposit::where('status', 2)->sum('amount');


        $data['totalWithdraw'] = Withdraw::where('status', 1)->sum('withdraw_amount');
        $data['pendingWithdraw'] = Withdraw::where('status', 0)->sum('withdraw_amount');

        $data['totalUser'] = User::count();
        $data['pendingUser'] = User::where('status', 0)->count();
        $data['activeUser'] = User::where('status', 1)->count();
        $data['emailUser'] = User::where('status', 1)->where('is_email_verified',1)->count();

        $data['totalTicket'] = Ticket::count();
        $data['pendingTicket'] = Ticket::whereStatus(2)->count();

        $data['totalOnlineGateway'] = Gateway::where('type', 1)->count();
        $data['totalOfflineGateway'] = Gateway::where('type', 0)->count();
        $data['totalWithdrawGateway'] = WithdrawGateway::where('status', 1)->count();

        $data['totalStaff'] = Admin::where('type', '!=', 'super')->count();
        $data['users'] = User::search($request->search)->latest()->paginate(Helper::pagination(),['*'],'users');


        $data['subscriptionAmount'] = Payment::where('status', 1)->sum('amount');
        $data['charge'] = Payment::where('status', 1)->sum('charge');
        $data['pending_payment'] = Payment::where('status', 2)->sum('amount');
---
select sum(`amount`) as aggregate from `sp_deposits` where `status` = 1
select sum(`amount`) as aggregate from `sp_deposits` where `status` = 2
select sum(`withdraw_amount`) as aggregate from `sp_withdraws` where `status` = 1
select sum(`withdraw_amount`) as aggregate from `sp_withdraws` where `status` = 0
select count(*) as aggregate from `sp_users`
select count(*) as aggregate from `sp_users` where `status` = 0
select count(*) as aggregate from `sp_users` where `status` = 1
select count(*) as aggregate from `sp_users` where `status` = 1 and `is_email_verified` = 1
select count(*) as aggregate from `sp_tickets`
select count(*) as aggregate from `sp_tickets` where `status` = 2
select count(*) as aggregate from `sp_gateways` where `type` = 1
select count(*) as aggregate from `sp_gateways` where `type` = 0
select count(*) as aggregate from `sp_withdraw_gateways` where `status` = 1
select count(*) as aggregate from `sp_admins` where `type` != 'super'
select * from `sp_users` order by `created_at` desc limit 10 offset 0
select sum(`amount`) as aggregate from `sp_payments` where `status` = 1
select sum(`charge`) as aggregate from `sp_payments` where `status` = 1
select sum(`amount`) as aggregate from `sp_payments` where `status` = 2

        $withdrawTotalAmount = array();
        $depositsTotalAmount = array();

        $payments = Payment::where('status', 1)
            ->select(DB::raw('SUM(total) as total'), DB::raw('MONTHNAME(created_at) month'))
            ->groupby('month')
            ->get();
        $withdraws = Withdraw::where('status', 1)
            ->select(DB::raw('SUM(withdraw_amount) as total'), DB::raw('MONTHNAME(created_at) month'))
            ->groupby('month')
            ->get();

        $deposits = Deposit::where('status', 1)
            ->select(DB::raw('SUM(total) as total'), DB::raw('MONTHNAME(created_at) as month'))
            ->groupby('month')
            ->get();
---
select SUM(total) as total, MONTHNAME(created_at) month from `sp_payments` where `status` = 1 group by `month`
select SUM(withdraw_amount) as total, MONTHNAME(created_at) month from `sp_withdraws` where `status` = 1 group by `month`
select SUM(total) as total, MONTHNAME(created_at) as month from `sp_deposits` where `status` = 1 group by `month`

        $data['withdrawTotalAmount'] = $withdrawTotalAmount;
        $data['depositsTotalAmount'] = $depositsTotalAmount;

        $data['browser'] = UserLog::select(DB::raw('COUNT(browser) as total'),'browser')->groupBy('browser')->get();

        $data['logTotal'] = UserLog::count();



        $data['investments'] = Payment::when($request->trx, function($item) use($request){

            $item->where('transaction_id', $request->trx);

        })->where('status',1)->latest()->with('user','plan')->limit(4)->get();



        $data['deposits'] = Deposit::where('status',1)->latest()->with('user')->limit(4)->get();
        $data['withdraws'] = Withdraw::where('status',1)->latest()->with('user','withdrawMethod')->limit(4)->get();


        $metmaskUser = Metamask::all()->pluck('trx_id');
        $data['metamask_ptop'] = Transaction::with('user')->whereIn('id',$metmaskUser)->sum('amount');
        $data['admin_ptop'] = Transaction::with('user')->whereNotIn('id',$metmaskUser)->where('type_two', '=',7)->where('type','+')->sum('amount');
        $data['ptop'] = Transaction::with('user')->where('type_two', '=', 6)->where('type', '+')->sum('amount');
---
select COUNT(browser) as total, `browser` from `sp_user_logs` group by `browser`
select count(*) as aggregate from `sp_user_logs`
select * from `sp_payments` where `status` = 1 order by `created_at` desc limit 4
select * from `sp_deposits` where `status` = 1 order by `created_at` desc limit 4
select * from `sp_users` where `sp_users`.`id` in (30, 31)
select * from `sp_users` where `sp_users`.`id` in (30)
select * from `sp_withdraws` where `status` = 1 order by `created_at` desc limit 4
select sum(`amount`) as aggregate from `sp_transactions` where `id` in ('131', '132', '139', '140')
select sum(`amount`) as aggregate from `sp_transactions` where `id` not in ('131', '132', '139', '140') and `type_two` = 7 and `type` = '+'
select sum(`amount`) as aggregate from `sp_transactions` where `type_two` = 6 and `type` = '+'