main/app/Http/Controllers/Backend/ManageDepositController.php

select * from `sp_deposits` where `type` = 0 and `status` != 1 order by `created_at` desc limit 10 offset 0
select * from `sp_gateways` where `sp_gateways`.`id` in (16)
select * from `sp_users` where `sp_users`.`id` in (39)
select count(*) as aggregate from `sp_deposits` where `type` = 0 and `status` != 1
---
    public function index(Request $request)
    {
        $type = $request->status === 'online' ? 1 : 0;

        $deposit = Deposit::query();

        if($request->search){
//            $deposit->search($request->search);
            $deposit->where('trx', 'like', '%' . $request->search . '%');
        }

        if($request->date){

            $date = array_map(function($item){
                return Carbon::parse($item);
            },explode(' - ', $request->date));

            $deposit->whereBetween('created_at', $date);
        }


        if($type == 1){
            $deposit->where('status',1);
        }else{
            $deposit->where('type', $type);
        }

        $data['deposits'] = $deposit->with('gateway','user')->latest()->paginate( Helper::pagination());

select * from `sp_deposits` where `trx` = '2DYMVI2BPXP7EVGK' limit 1
select * from `sp_configurations` limit 1
select * from `sp_gateways` where `sp_gateways`.`id` = 16 limit 1
update `sp_deposits` set `status` = 1, `sp_deposits`.`updated_at` = '2026-01-23 12:56:27' where `id` = 38
insert into `sp_transactions` (`trx`, `amount`, `details`, `charge`, `type`, `type_two`, `rec_id`, `user_id`, `updated_at`, `created_at`) values ('2DYMVI2BPXP7EVGK', '30.00000000', 'Payment Deposit Successfully', 0, '+', 1, 0, 39, '2026-01-23 12:56:27', '2026-01-23 12:56:27')
select * from `sp_users` where `sp_users`.`id` = 39 limit 1
update `sp_users` set `tx` = 90, `balance` = '30.00000000', `sp_users`.`updated_at` = '2026-01-23 12:56:27' where `id` = 39
---
    public function accept(Request $request)
    {

        $deposit = Deposit::where('trx', $request->trx)->firstOrFail();

        $general = Configuration::first();
        $gateway = Gateway::find($deposit->gateway_id);
        $deposit->status = 1;
        $deposit->save();
        Transaction::create([
                    'trx' => $deposit->trx,
                    'amount' => $deposit->amount,
                    'details' => 'Payment Deposit Successfully',
                    'charge' => 0,
                    'type' => '+',
                    'type_two' => 1,
                    'rec_id' => 0,
                    'user_id' => auth()->id()
                ]);
        $user = User::find($deposit->user->id);

        if($user->tx >$user->ttx){
           $user->balance = $user->balance + $deposit->amount;
           $user->tx =  $user->tx + ($deposit->amount * 3);
           $user->update();
       }
       else{
           $user->balance =  $deposit->amount;
           $user->tx = $user->tx +  ($deposit->amount * 3);
           $user->update();

select sum(`amount`) as aggregate from `sp_deposits` where `user_id` = 42
select * from `sp_users` where `status` = 1 and `id` = 42 limit 1
---

    //    <------------->
       if($user->ref_id!=0){
           $deposit = Deposit::where('user_id',$user->ref_id)->sum('amount');
           $reffer_user = User::where('status', '=', 1)->where('id', $user->ref_id)->first();

update `sp_users` set `ttx` = 3.5, `sp_users`.`updated_at` = '2026-02-05 12:16:22' where `id` = 42
insert into `sp_transactions` (`trx`, `amount`, `details`, `charge`, `type`, `type_two`, `rec_id`, `user_id`, `updated_at`, `created_at`) values ('S051RQL7J2MTYNY3', 3.5, 'Deposit Profit added by afzal5554', 0, '+', 3, 42, 42, '2026-02-05 12:16:22', '2026-02-05 12:16:22')
---
               if($userDeposit >= $check){

                   $reffer_user->ttx = $reffer_user->ttx + ($deposit->amount * 0.07);
                   $reffer_user->update();
                   Transaction::create([
                       'trx' => Str::upper(Str::random(16)),
                       'amount' => ($deposit->amount * 0.07),
                       'details' => 'Deposit Profit added by ' . $user->username2 ?? ' ',
                       'charge' => 0,
                       'type' => '+',
                       'type_two' => 3,
                       'rec_id' => auth()->id(),
                       'user_id' => $reffer_user->id,
                   ]);

select * from `sp_templates` where `name` = 'payment_confirmed' and `status` = 1 limit 1
---
           }

       }
        $template = Template::where('name','payment_confirmed')->where('status',1)->first();