main/app/Http/Controllers/Backend/ManageSectionController.php

    public function section(Request $request)
    {

        $data['sections'] = Config::sections();

        $data['elements'] = Content::where('theme', Helper::config()->theme)->where('type', 'iteratable')->where('name', $request->name)->get();
---
select * from `sp_contents` where `theme` = 'default' and `type` = 'iteratable' and `name` = 'banner'