main/app/Services/UserRegistration.php

select * from `sp_configurations` limit 1
select * from `sp_users` where `phone` = '+21365464612' limit 1
select * from `sp_users` where `username` = '499568' limit 1
---
    public function register($request)
    {
        $general = Configuration::first();

        $fullPhoneNumber = '+' . $request->code . ltrim($request->phone, '0');
        $referPhone = User::where('phone', $fullPhoneNumber)->first();
        if ($referPhone) {
            return ['type' => 'error', 'message' => 'This phone has already been taken'];
        }
        $signupBonus = $general->signup_bonus;

        $referid = 0;
        $referUser = '';
        if ($request->reffered_by) {
            $referUser = User::where('username', $request->reffered_by)->first();

insert into `sp_users` (`balance`, `tx`, `username`, `username2`, `first_name`, `last_name`, `email`, `phone`, `code`, `status`, `password`, `ref_id`, `updated_at`, `created_at`) values (0, 0, '248408', 'afzal5554', 'Muhammad', 'Afzal', 'afzal5554@gmail.com', '+21365464612', '+213', 1, '$2y$10$wQr69ZzEvkzgxAS5y5qmGORyPjiqO3HpiReJOAAzKWkTgcGSWuBaq', 42, '2026-02-05 10:58:24', '2026-02-05 10:58:24')
---
    public function create($request, $signupBonus, $referid)
    {


        $fullPhoneNumber = '+' . $request->code . ltrim($request->phone, '0');

        return User::create([
            'balance' => 0,
            'tx' => 0,
            'username' => $request->username,
            'username2' => $request->username2,
            'first_name' => $request->first_name,
            'last_name' => $request->last_name,
            'email' => $request->email,
            'phone' => $fullPhoneNumber,
            'code' => '+'.$request->code,
            'status' => 1,
            'password' => bcrypt($request->password),
            'ref_id' => $referid ?? ''
        ]);