main/app/Services/UserLogin.php

insert into `sp_user_logs` (`user_id`, `browser`, `system`, `country`, `ip`, `updated_at`, `created_at`) values (39, 'Chrome', 'Windows', '', '', '2026-01-19 12:31:59', '2026-01-19 12:31:59')
---
    public function login($request)
    {
        // Check if the input is a valid email address
        if (filter_var($request->email, FILTER_VALIDATE_EMAIL)) {
            // If it's a valid email address, attempt login using email
            if (Auth::attempt(['email' => $request->email, 'password' => $request->password])) {
                // Log user activity
            $ip = request()->ip();
            $currentUserInfo = Location::get($ip);

            $browser = new Browser();
            $os = new Os();

            UserLog::create([
                'user_id' => auth()->id(),
                'browser' => $browser->getName(),
                'system' => $os->getName(),
                'country' => $currentUserInfo->countryName ?? '',
                'ip' => $currentUserInfo->ip ?? '',
            ]);