main/app/Services/UserDashboardService.php

    public function dashboard()
    {
        $user = auth()->user();

        $data['currentPlan'] = $user->currentplan()->first();

        if ($data['currentPlan'] != null) {
            $data['signalGraph'] =  UserSignal::where('user_id', auth()->id())->select(DB::raw('COUNT(*) as total'), DB::raw('MONTHNAME(created_at) month'))
            ->groupby('month')
            ->get();
        }


        $data['totalbalance'] = $user->balance;
        $data['staking_amount'] = $user->deposits()->where('status', 1)->sum('amount');
        $data['staking_reward'] = Transaction::where('user_id','=',$user->id)->where('rec_id','=',0)->where('type_two',5)->sum('amount');
//        $data['myTeamm'] = PivortUser::where('ref_id',$user->id)->pluck('user_id');
//        $data['myTeamTwo'] = PivortUser::where(function ($query) use ($data, $user) {
//            $query->where('ref_id', $user->id)
//                ->orWhereIn('ref_id', $data['myTeamm']);
//        });
//        $data['myTeam'] = $data['myTeamTwo']->pluck('user_id')->unique()->count();
        $data['myTeam'] = PivortUser::where('ref_id',$user->id)->count();
        $direct_user = PivortUser::where('ref_id','=',$user->id)->where('level',1)->pluck('user_id');
        $data['directReward'] = Transaction::where('user_id','=',$user->id)->WhereIn('rec_id',$direct_user)->where('type_two',3)->sum('amount');

        $data['teamReward'] = Transaction::where('user_id','=',$user->id)->where('rec_id','!=',0)->where('type_two',5)->sum('amount');

        $data['totalReward'] = $data['directReward'] + $data['staking_reward'] + $data['teamReward'];

        $data['totalWithdraw'] = $user->withdraws()->where('status', 1)->sum('withdraw_amount');
        $data['totalPayments'] = $user->payments()->where('status', 1)->sum('amount');
        $data['totalSupportTickets'] = $user->tickets()->count();
        $data['user'] = $user;
        $data['transactions'] = $user->transactions()->latest()->with('user')->limit(3)->get();
        $transactionss = Transaction::where('user_id',$user->id)->selectRaw('DAYOFWEEK(created_at) as day, SUM(amount) as total_amount')->groupBy('day')->get();
---
select sum(`amount`) as aggregate from `sp_deposits` where `sp_deposits`.`user_id` = 30 and `sp_deposits`.`user_id` is not null and `status` = 1
select sum(`amount`) as aggregate from `sp_transactions` where `user_id` = 30 and `rec_id` = 0 and `type_two` = 5
select count(*) as aggregate from `sp_pivort_users` where `ref_id` = 30
select `user_id` from `sp_pivort_users` where `ref_id` = 30 and `level` = 1
select sum(`amount`) as aggregate from `sp_transactions` where `user_id` = 30 and `rec_id` in (31, 32, 34) and `type_two` = 3
select sum(`amount`) as aggregate from `sp_transactions` where `user_id` = 42 and `rec_id` != 0 and `type_two` = 5
select sum(`withdraw_amount`) as aggregate from `sp_withdraws` where `sp_withdraws`.`user_id` = 42 and `sp_withdraws`.`user_id` is not null and `status` = 1
select sum(`amount`) as aggregate from `sp_payments` where `sp_payments`.`user_id` = 42 and `sp_payments`.`user_id` is not null and `status` = 1
select count(*) as aggregate from `sp_tickets` where `sp_tickets`.`user_id` = 42 and `sp_tickets`.`user_id` is not null
select * from `sp_transactions` where `sp_transactions`.`user_id` = 42 and `sp_transactions`.`user_id` is not null order by `created_at` desc limit 3
select * from `sp_users` where `sp_users`.`id` in (42)
select DAYOFWEEK(created_at) as day, SUM(amount) as total_amount from `sp_transactions` where `user_id` = 42 group by `day`

                'total_amount' => $transaction->total_amount,
            ];
        })->toJson();
        $data['signals'] = DashboardSignal::where('user_id', $user->id)->latest()->with('signal.market', 'signal.pair', 'signal.time', 'user')->paginate(Helper::pagination());
---
select count(*) as aggregate from `sp_dashboard_signals` where `user_id` = 42

            $signalGrapTotal->push(0);
        }

        $payment = Payment::where('status', 1)
            ->where('user_id', auth()->id())
            ->whereYear('created_at', '=', now())
            ->select(DB::raw('SUM(amount) as total'), DB::raw('MONTHNAME(created_at) month'))
            ->groupby('month')->get();

        $withdraw = Withdraw::where('status', 1)
            ->where('user_id', auth()->id())
            ->select(DB::raw('SUM(withdraw_amount) as total'), DB::raw('MONTHNAME(created_at) month'))
            ->groupby('month')
            ->get();


        $deposit = Deposit::where('status', 1)
            ->where('user_id', auth()->id())
            ->select(DB::raw('SUM(amount) as total'), DB::raw('MONTHNAME(created_at) month'))
            ->groupby('month')
            ->get();
---
select SUM(amount) as total, MONTHNAME(created_at) month from `sp_payments` where `status` = 1 and `user_id` = 42 and year(`created_at`) = '2026' group by `month`
select SUM(withdraw_amount) as total, MONTHNAME(created_at) month from `sp_withdraws` where `status` = 1 and `user_id` = 42 group by `month`
select SUM(amount) as total, MONTHNAME(created_at) month from `sp_deposits` where `status` = 1 and `user_id` = 42 group by `month`

        $data['signalGrapTotal'] = $signalGrapTotal;
        $data['months'] = $months;

        $userids = User::where('ref_id',$user->id)->where('status',1)->pluck('id');
        $data['weeklyTransactions'] = Transaction::whereIn('user_id', $userids)
            ->selectRaw('YEARWEEK(created_at) as week,
                 SUM(CASE WHEN type_two = "1" THEN amount ELSE 0 END) as total_deposits')
            ->groupBy('week')
            ->get();
---
select `id` from `sp_users` where `ref_id` = 42 and `status` = 1
select YEARWEEK(created_at) as week,
SUM(CASE WHEN type_two = "1" THEN amount ELSE 0 END) as total_deposits from `sp_transactions` where `user_id` in (31, 32, 34) group by `week`